src/Documents/SalesTaxPayment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>SalesTaxPayment</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.SalesTaxOwed</xr:Item>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxAgency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxAgencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxPeriodEnding</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingBasis</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountingMethod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Payment</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MadeAdjustment</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdjustmentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdjustmentReason</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdjustmentAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TotalPayment</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/SalesTaxOwed.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>SalesTaxOwed</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>GrossSale</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TaxableSale</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TaxPayable</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ChargeType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountingMethod</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Agency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TaxRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/SalesTaxPayment/Forms/DocumentForm/Ext/Form/Module.bsl
&AtClient
Procedure MadeAdjustmentOnChange(Item)
	Items.AdjustmentGroup.Enabled = Object.MadeAdjustment;
EndProcedure

&AtClient
Procedure PaymentOnChange(Item)
	RecalculateTotalPayment();
EndProcedure

&AtClient
Procedure RecalculateTotalPayment()
	Object.TotalPayment = Object.Payment + ?(Object.MadeAdjustment, Object.AdjustmentAmount, 0);
EndProcedure

&AtClient 
Procedure GetSalesTaxOwed()
	If Not (ValueIsFilled(Object.AccountingBasis) And ValueIsFilled(Object.SalesTaxAgency) And ValueIsFilled(Object.TaxPeriodEnding)) Then
		return;
	EndIf;
	If Object.Payment = 0 Then
		Object.Payment = GetSalesTaxOwedAmount(Object.SalesTaxAgency, Object.TaxPeriodEnding, Object.AccountingBasis);
	EndIf;
EndProcedure

&AtServerNoContext
Function GetSalesTaxOwedAmount(Agency, TaxPeriod, ChargeType)
	Request = New Query("SELECT ALLOWED
	                    |	SalesTaxRates.Ref
	                    |INTO TaxRates
	                    |FROM
	                    |	Catalog.SalesTaxRates AS SalesTaxRates
	                    |WHERE
	                    |	SalesTaxRates.Agency = &Agency
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |SELECT ALLOWED
	                    |	SalesTaxOwedBalance.TaxPayableBalance
	                    |FROM
	                    |	AccumulationRegister.SalesTaxOwed.Balance(
	                    |			,
	                    |			Agency IN
	                    |					(SELECT
	                    |						TaxRates.Ref
	                    |					FROM
	                    |						TaxRates)
	                    |				AND TaxPeriod <= &TaxPeriod
	                    |				AND ChargeType = &ChargeType) AS SalesTaxOwedBalance");	
	Request.SetParameter("Agency", Agency);
	Request.SetParameter("TaxPeriod", TaxPeriod);
	Request.SetParameter("ChargeType", ChargeType);
	Sel = Request.Execute().Select();
	SalesTaxAmountOwed = 0;
	If Sel.Next() Then
		SalesTaxAmountOwed = Sel.TaxPayableBalance;
	EndIf;
	return SalesTaxAmountOwed;
EndFunction

&AtClient
Procedure AdjustmentAmountOnChange(Item)
	RecalculateTotalPayment();
EndProcedure

&AtClient
Procedure SalesTaxAgencyOnChange(Item)
	GetSalesTaxOwed();
EndProcedure

&AtClient
Procedure TaxPeriodEndingOnChange(Item)
	GetSalesTaxOwed();
EndProcedure

&AtClient
Procedure AccountingBasisOnChange(Item)
	GetSalesTaxOwed();
EndProcedure
